app/views/movies/index.html.erb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" = 'G'  ORDER BY title
---
      <th class="<%=@title_header%>">
        <%= link_to "Movie Title", movies_path({:sort => 'title', :ratings => Hash[@ratings_to_show.collect {|item| [item, "1"]}]}), :id => 'title_header' %></th>