app/controllers/movies_controller.rb

  def index
    #Part 1 starts here:
    # @sort = params[:sort]
    # @movies = Movie.all
     @all_ratings = ['G','PG','PG-13','R']
    if params[:ratings].nil?
      @movies = Movie.order params[:order]
    else
      # filter movies based on ratings
      array_ratings = params[:ratings].keys
      @chosen_ratings = array_ratings
      @movies = Movie.where(rating: array_ratings).order params[:order]
---
SELECT "movies".* FROM "movies"  ORDER BY release_date
SELECT "movies".* FROM "movies" WHERE "movies"."rating" = 'G'  ORDER BY title

  def create
    @movie = Movie.create!(movie_params)
---
INSERT INTO "movies" ("title", "rating", "description", "release_date", "director", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)