app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."title" = ? LIMIT 1  [["title", "Star Wars"]]
---
  def same_dir
    @find_same_dir = Movie.find_same_dir(params[:title])